# Автомат получает на вход пятизначное число. По этому числу строится новое число по следующим правилам.
# Складываются отдельно первая, третья и пятая цифры, а также вторая и четвёртая цифры.
# Полученные два числа записываются друг за другом в порядке неубывания без разделителей.
# Пример. Исходное число: 63 179. Суммы: 6 + 1 + 9 = 16; 3 + 7 = 10. Результат: 1016.
# Укажите наименьшее число, при обработке которого автомат выдаёт результат 723.

def func (num):
    num1 = int(num[0]) + int(num[2]) + int(num[4])
    num2 = int(num[1]) + int(num[3])
    return str(min(num1, num2))+str(max(num1, num2))
for i in range(10000, 99999):
    if (func(str(i))== '723'):
        print(i)
    